# RbsElecDistributionNodeSupplyTo Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecDistributionNodeSupplyTo Property
ParameterTypeId Class See Also
---
"Supply To"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecDistributionNodeSupplyTo { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecDistributionNodeSupplyTo As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecDistributionNodeSupplyTo {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace